tap "buo/cask-upgrade"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "square/formula", "org-49461806@github.com:squareup/homebrew-formulas.git"
tap "withgraphite/tap"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Memory upgrade for your coding agent
brew "beads"
# Double-entry accounting tool that works on plain text files
brew "beancount"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Tool that bootstraps your dotfiles
brew "dotbot"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# TUI Git client inspired by Magit
brew "gitu"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Update multiple git repositories at once
brew "gitup"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Open source relational database management system
brew "mysql"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Source-code syntax highlighter
brew "source-highlight"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@29", link: false
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@31"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac@29", link: false
brew "square/formula/aws-creds"
brew "square/formula/beyond-curl"
# An SSH Agent that provides keys signed by Block Certificate Authorities (sharkey, gh-ssh-certifier)
brew "square/formula/block-ssh-agent"
brew "square/formula/cash-kta"
brew "square/formula/polyrepo"
brew "square/formula/ski-cli"
brew "square/formula/sq"
brew "square/formula/sq-run"
# Square Android Toolbox (SaToolbox)
brew "square/formula/sq-satoolbox"
brew "square/formula/sqm"
# SSH config for accessing Square services
brew "square/formula/square-ssh-config"
brew "square/formula/yubidisaster"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Scriptable scratchpad for developers
cask "boop"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# AI agent operator
cask "commander"
# Claude code parallelisation
cask "conductor"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Write, edit, and chat about your code with AI
cask "cursor"
cask "font-blex-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Menu bar app that provides more control over Night Shift
cask "shifty"
# React client for Simplenote
cask "simplenote"
# Music streaming service
cask "spotify"
# To-do list
cask "todoist-app"
# SSH server for teams managing distributed infrastructure
cask "tsh"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Multiplayer code editor
cask "zed"
vscode "bierner.markdown-mermaid"
vscode "mechatroner.rainbow-csv"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
go "golang.org/x/tools/gopls"
