###
# Run `brew bundle` in this directory to install all of this stuff
###

cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'grc' # colourize log commands (e.g. ``grc tail /var/log/syslog`)
brew 'imagemagick'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'tree'
brew 'fzf'
brew 'fasd'
brew 'highlight' # for `less` highlighting (see `.zshenv`)
brew 'lesspipe'
brew 'readline'
brew 'unrar'
brew 'wget'
brew 'htop'
brew 'ffmpeg' # for youtube-dl post-processing
brew 'youtube-dl' # download Youtube (and other) videos


###
# Development
###

# searching
brew 'ripgrep' # rg
brew 'the_silver_searcher' # ag

# programming languages
cask 'java'
brew 'go'
brew 'node'
brew 'nvm' # node version manager
brew 'leiningen' # clojure
brew 'boot-clj' # clojure
brew 'haskell-stack'
brew 'erlang'
brew 'elixir'
brew 'scala'
brew 'sbt' # scala build tool
brew 'chruby' # lightweight ruby version manager
brew 'ruby-install'

# DBs
brew 'postgresql'
brew 'mysql'

# editors
brew 'emacs'
tap 'neovim/neovim'
brew 'neovim'

# tools
brew 'heroku'
brew 'heroku-toolbelt'
brew 'docker'
cask 'docker' # docker-for-mac
brew 'docker-machine' # for docker-compose to install
brew 'docker-compose'
brew 'ctags'
brew 'jq' # json processor
brew 'tig' # git visualization
brew 'httpie' # smart curl replacement?

# fonts
tap 'caskroom/fonts'
# for programming
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'font-anonymous-pro'
cask 'font-terminus'
cask 'font-dejavu-sans'
cask 'font-hack'
cask 'font-roboto-mono'
# `mensch` font is also great for programming, but it's not in caskroom/fonts :(
#    http://robey.lag.net/2010/06/21/mensch-font.html
# for icons (mostly used within emacs)
cask 'font-devicons'
cask 'font-icomoon'
cask 'font-fontawesome'
cask 'font-mfizz'
cask 'font-octicons'


###
# OSX applications
###
cask 'lastpass'
cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'transmission' # torrenting
cask 'vlc'
cask 'alfred' # spotlight replacement
cask 'iterm2'
cask 'karabiner' # keyboard mapping
cask 'karabiner-elements' # rebind capslock
cask 'spotify'
cask 'spectacle' # window management
cask 'contexts' # command-tab replacement
cask 'goofy' # facebook messenger
cask 'flux' # blue light removal
cask 'smcfancontrol'
cask 'scroll-reverser'
cask 'caffeine' # control over screen locking
